import { images } from '@/data/images.ts'

export const itSliderStages = [
  {
    id: 1,
    image: images.maxim,
    title: 'Модуль серверной части за 2 недели',
    name: 'Максим Левин',
    text: [
      { text: 'Разработал серверную часть веб-приложения:', highlight: true },
      {
        text: 'модуль аутентификации и разграничения прав, интеграции и SQL-отчётность. Автотесты подтвердили стабильность при любых сценариях ролей',
      },
    ],
  },

  {
    id: 2,
    image: images.kirill,
    title: 'Стажировка и трудоустройство после 1 курса',
    name: 'Кирилл Паршин',
    text: [
      { text: 'За время учёбы' },
      { text: 'собрал ИИ-бота на Project Camp', highlight: true },
      { text: 'и участвовал в хакатонах. После первого курса' },
      { text: 'отстажировался в giper.fm', highlight: true },
      { text: 'с последующим трудоустройством' },
    ],
  },

  {
    id: 3,
    image: images.maxim,
    title: 'Модуль серверной части за 2 недели',
    name: 'Максим Левин',
    text: [
      { text: 'Разработал серверную часть веб-приложения:', highlight: true },
      {
        text: 'модуль аутентификации и разграничения прав, интеграции и SQL-отчётность. Автотесты подтвердили стабильность при любых сценариях ролей',
      },
    ],
  },

  {
    id: 4,
    image: images.kirill,
    title: 'Стажировка и трудоустройство после 1 курса',
    name: 'Кирилл Паршин',
    text: [
      { text: 'За время учёбы' },
      { text: 'собрал ИИ-бота на Project Camp', highlight: true },
      { text: 'и участвовал в хакатонах. После первого курса' },
      { text: 'отстажировался в giper.fm', highlight: true },
      { text: 'с последующим трудоустройством' },
    ],
  },
]

export const itCases = [
  {
    id: 1,
    title: 'Интернет-маркетолог',
    description:
      'Помогает бизнесу находить клиентов, увеличивать продажи и понимать, какие инструменты работают',
    features: [
      'Научишься разрабатывать маркетинговые стратегии для бизнеса',
      'Освоишь анализ рынка, конкурентов и целевой аудитории',
      'Научишься разрабатывать маркетинговые стратегии для бизнеса',
      'Запустишь рекламные кампании в Яндекс и VK и научишься оценивать их эффективность',
      'Погрузишься в веб-аналитику, CRM и инструменты принятия маркетинговых решений',
    ],
    tags: [
      'Разработка маркетинговой стратегии',
      'Контент-маркетинг',
      'Веб-аналитика',
      'Медиапланирование',
    ],
    code: 'ФГОС 42.02.01',
    links: ['Программа на базе 9 классов', 'Программа на базе 11 классов'],
  },

  {
    id: 2,
    title: 'SMM-специалист',
    description:
      'Создаёт контент, который привлекает внимание, собирает сообщество и приносит бизнесу клиентов',
    features: [
      'Научишься разрабатывать маркетинговые стратегии для бизнеса',
      'Освоишь анализ рынка, конкурентов и целевой аудитории',
      'Научишься разрабатывать маркетинговые стратегии для бизнеса',
      'Запустишь рекламные кампании в Яндекс и VK и научишься оценивать их эффективность',
      'Погрузишься в веб-аналитику, CRM и инструменты принятия маркетинговых решений',
    ],
    tags: ['Контент-маркетинг', 'Основы графических редакторов', 'Таргетинг'],
    code: 'ФГОС 42.02.01',
    links: ['Программа на базе 9 классов', 'Программа на базе 11 классов'],
  },

  {
    id: 3,
    title: 'SMM-специалист',
    description:
      'Создаёт контент, который привлекает внимание, собирает сообщество и приносит бизнесу клиентов',
    features: [
      'Научишься разрабатывать маркетинговые стратегии для бизнеса',
      'Освоишь анализ рынка, конкурентов и целевой аудитории',
      'Научишься разрабатывать маркетинговые стратегии для бизнеса',
    ],
    tags: ['Контент-маркетинг', 'Основы графических редакторов', 'Таргетинг'],
    code: 'ФГОС 42.02.01',
    links: ['Программа на базе 9 классов', 'Программа на базе 11 классов'],
  },
]
